MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN64VMP5/mcu.h
/****************************************************************************
**
** Copyright (C) 2024 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MK10DN64VMP5_H__
#define __MK10DN64VMP5_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   128              // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -122             // Not available device specific interrupt
#define InitStackPointer_IRQn                   -16              // Initial Stack Pointer
#define InitProgramCounter_IRQn                 -15              // Initial Program Counter
#define NonMaskableInterrupt_IRQn               -14              // Non-maskable Interrupt (NMI)
#define HardFault_IRQn                          -13              // Hard Fault
#define MemManageFault_IRQn                     -12              // MemManage Fault
#define BusFault_IRQn                           -11              // Bus Fault
#define UsageFault_IRQn                         -10              // Usage Fault
#define SVCall_IRQn                             -5               // Supervisor call (SVCall)
#define DebugMonitor_IRQn                       -4               // Debug Monitor
#define PendSV_IRQn                             -2               // Pendable request for system service (PendableSrvReq)
#define SysTick_IRQn                            -1               // System tick timer (SysTick)
#define DMA0_IRQn                               0                // DMA channel 0 transfer complete
#define DMA1_IRQn                               1                // DMA channel 1 transfer complete
#define DMA2_IRQn                               2                // DMA channel 2 transfer complete
#define DMA3_IRQn                               3                // DMA channel 3 transfer complete
#define DMA_Error_IRQn                          4                // DMA error interrupt channel
#define DMA_IRQn                                5                // -
#define Command_Complete_IRQn                   6                // Command complete
#define Read_Collision_IRQn                     7                // Read collision
#define PMC_IRQn                                8                // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               9                // Low Leakage Wakeup
#define WDOG_EWM_IRQn                           10               // Both EWM and WDOG interrupt sources set this IRQ
#define I2C0_IRQn                               11               // -
#define SPI0_IRQn                               12               // Single interrupt vector for all sources
#define Transmit_IRQn                           13               // Transmit
#define Receive_IRQn                            14               // Receive
#define UART0_RX_TX_LON_IRQn                    15               // Single interrupt vector for CEA7091-B (LON) status sources
#define UART0_RX_TX_IRQn                        16               // Single interrupt vector for UART status sources
#define UART0_ERR_IRQn                          17               // Single interrupt vector for UART error sources
#define UART1_RX_TX_IRQn                        18               // Single interrupt vector for UART status sources
#define UART1_ERR_IRQn                          19               // Single interrupt vector for UART error sources
#define UART2_RX_TX_IRQn                        20               // Single interrupt vector for UART status sources
#define UART2_ERR_IRQn                          21               // Single interrupt vector for UART error sources
#define ADC0_IRQn                               22               // -
#define CMP0_IRQn                               23               // -
#define CMP1_IRQn                               24               // -
#define FTM0_IRQn                               25               // -
#define FTM1_IRQn                               26               // -
#define CMT_IRQn                                27               // -
#define Alarm_Interrupt_IRQn                    28               // Alarm interrupt
#define Seconds_Interrupt_IRQn                  29               // Seconds interrupt
#define PIT0_IRQn                               30               // Channel 0
#define PIT1_IRQn                               31               // Channel 1
#define PIT2_IRQn                               32               // Channel 2
#define PIT3_IRQn                               33               // Channel 3
#define PDB_IRQn                                34               // -
#define Reserved_IRQn                           35               // -
#define Reserved_IRQn                           36               // -
#define TSI_IRQn                                37               // -
#define MCG_IRQn                                38               // -
#define LPTMR0_IRQn                             39               // -
#define PORTA_IRQn                              40               // Pin detect (Port A)
#define PORTB_IRQn                              41               // Pin detect (Port B)
#define PORTC_IRQn                              42               // Pin detect (Port C)
#define PORTD_IRQn                              43               // Pin detect (Port D)
#define PORTE_IRQn                              44               // Pin detect (Port E)
#define Software_initiated_IRQn                 45               // -
#define Reserved_IRQn                           46               // -
#define Reserved_IRQn                           47               // -
#define Reserved_IRQn                           48               // -
#define Reserved_IRQn                           49               // -
#define Reserved_IRQn                           50               // -
#define Reserved_IRQn                           51               // -
#define Reserved_IRQn                           52               // -
#define TSI_IRQn                                53               // -
#define MCG_IRQn                                54               // -
#define LPTMR0_IRQn                             55               // -
#define PORTA_IRQn                              56               // Pin detect (Port A)
#define PORTB_IRQn                              57               // Pin detect (Port B)
#define PORTC_IRQn                              58               // Pin detect (Port C)
#define PORTD_IRQn                              59               // Pin detect (Port D)
#define PORTE_IRQn                              60               // Pin detect (Port E)
#define Software_initiated_IRQn                 61               // -
#define Reserved_IRQn                           62               // -
#define Reserved_IRQn                           63               // -
#define Reserved_IRQn                           64               // -
#define Reserved_IRQn                           65               // -
#define Reserved_IRQn                           66               // -
#define Reserved_IRQn                           67               // -
#define Reserved_IRQn                           68               // -
#define TSI_IRQn                                69               // -
#define MCG_IRQn                                70               // -
#define LPTMR0_IRQn                             71               // -
#define PORTA_IRQn                              72               // Pin detect (Port A)
#define PORTB_IRQn                              73               // Pin detect (Port B)
#define PORTC_IRQn                              74               // Pin detect (Port C)
#define PORTD_IRQn                              75               // Pin detect (Port D)
#define PORTE_IRQn                              76               // Pin detect (Port E)
#define Software_initiated_IRQn                 77               // -
#define Reserved_IRQn                           78               // -
#define Reserved_IRQn                           79               // -
#define Reserved_IRQn                           80               // -
#define Reserved_IRQn                           81               // -
#define Reserved_IRQn                           82               // -
#define Reserved_IRQn                           83               // -
#define Reserved_IRQn                           84               // -
#define Reserved_IRQn                           85               // -
#define Reserved_IRQn                           86               // -
#define Reserved_IRQn                           87               // -
#define Reserved_IRQn                           88               // -
#define Reserved_IRQn                           89               // -
#define Reserved_IRQn                           90               // -
#define Reserved_IRQn                           91               // -
#define Reserved_IRQn                           92               // -
#define Reserved_IRQn                           93               // -
#define Reserved_IRQn                           94               // -
#define Reserved_IRQn                           95               // -
#define Reserved_IRQn                           96               // -
#define Reserved_IRQn                           97               // -
#define Reserved_IRQn                           98               // -
#define Reserved_IRQn                           99               // -
#define Reserved_IRQn                           100              // -
#define Reserved_IRQn                           101              // -
#define Reserved_IRQn                           102              // -
#define Reserved_IRQn                           103              // -
#define Reserved_IRQn                           104              // -
#define Reserved_IRQn                           105              // -
#define Reserved_IRQn                           106              // -
#define Reserved_IRQn                           107              // -
#define Reserved_IRQn                           108              // -
#define Reserved_IRQn                           109              // -
#define Reserved_IRQn                           110              // -
#define Reserved_IRQn                           111              // -



//*****************************************************************************
//
// Port control and interrupts (PORT) registers
//
//*****************************************************************************

